Repository: daltonrooney/meeting-recorder
Catalog: CallTranscription/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, zh_hans

# settings.filenameTemplate.accessibility.label
source: Filename template
de: Dateinamenvorlage
es: Plantilla de nombre de archivo
fr: Modèle de nom de fichier
ja: ファイル名テンプレート
zh_hans: 文件名模板

# settings.filenameTemplate.helpText
source: Use {date} and {time} for dynamic values. Example: meeting_{date}_{time}.txt
de: Verwenden Sie {date} und {time} für dynamische Werte. Beispiel: meeting_{date}_{time}.txt
es: Use {date} y {time} para valores dinámicos. Ejemplo: reunion_{date}_{time}.txt
fr: Utilisez {date} et {time} pour les valeurs dynamiques. Exemple: reunion_{date}_{time}.txt
ja: 動的な値には {date} と {time} を使用します。例: meeting_{date}_{time}.txt
zh_hans: 使用 {date} 和 {time} 作为动态值。示例：meeting_{date}_{time}.txt

# settings.filenameTemplate.label
source: Filename Template
de: Dateinamenvorlage
es: Plantilla de nombre de archivo
fr: Modèle de nom de fichier
ja: ファイル名テンプレート
zh_hans: 文件名模板

# settings.output.folder.accessibility.hint
source: Path where transcripts will be saved
de: Pfad des Ordners, in dem Transkriptionen gespeichert werden
es: Ruta de la carpeta donde se guardarán las transcripciones
fr: Chemin du dossier où les transcriptions seront enregistrées
ja: トランスクリプトが保存されるフォルダのパス
zh_hans: 保存转录的文件夹路径

# settings.output.folder.accessibility.label
source: Output Folder
de: Ausgabeordner
es: Carpeta de salida
fr: Dossier de sortie
ja: 出力フォルダ
zh_hans: 输出文件夹

# settings.output.folder.browse.accessibility.hint
source: Opens a dialog to select where transcripts will be saved
de: Öffnet einen Dialog zur Auswahl des Ausgabeordners
es: Abre un diálogo para seleccionar la carpeta de salida
fr: Ouvre une boîte de dialogue pour sélectionner le dossier de sortie
ja: 出力フォルダを選択するダイアログを開きます
zh_hans: 打开对话框以选择输出文件夹

# settings.output.folder.browse.accessibility.label
source: Browse for Output Folder
de: Ausgabeordner durchsuchen
es: Examinar carpeta de salida
fr: Parcourir le dossier de sortie
ja: 出力フォルダを参照
zh_hans: 浏览输出文件夹

# settings.output.folder.browseButton
source: Browse...
de: Durchsuchen…
es: Examinar…
fr: Parcourir…
ja: 参照…
zh_hans: 浏览…

# settings.output.folder.dialog.message
source: Choose where transcripts will be saved
de: Wählen Sie den Ordner aus, in dem Transkriptionen gespeichert werden
es: Elige la carpeta donde se guardarán las transcripciones
fr: Choisissez le dossier où les transcriptions seront enregistrées
ja: トランスクリプトを保存するフォルダを選択してください
zh_hans: 选择保存转录的文件夹

# settings.output.folder.dialog.prompt
source: Select Output Folder
de: Auswählen
es: Seleccionar
fr: Sélectionner
ja: 選択
zh_hans: 选择

# settings.output.folder.label
source: Output Folder
de: Ausgabeordner
es: Carpeta de salida
fr: Dossier de sortie
ja: 出力フォルダ
zh_hans: 输出文件夹

# settings.output.header
source: Output
de: Ausgabe
es: Salida
fr: Sortie
ja: 出力
zh_hans: 输出

# settings.output.helpText
source: Transcripts will be saved to this folder. When enabled, original audio recordings will also be saved in M4A format.
de: Transkriptionen werden in diesem Ordner gespeichert. Das Original-Audio wird neben der Transkription gespeichert, wenn aktiviert.
es: Las transcripciones se guardarán en esta carpeta. El audio original se guardará junto a la transcripción si está habilitado.
fr: Les transcriptions seront enregistrées dans ce dossier. L'audio d'origine sera enregistré à côté de la transcription si activé.
ja: トランスクリプトはこのフォルダに保存されます。有効にすると、元の音声がトランスクリプトと一緒に保存されます。
zh_hans: 转录将保存在此文件夹中。如果启用，原始音频将保存在转录旁边。

# settings.output.saveOriginalAudio.accessibility.hint
source: When enabled, saves original audio recordings in M4A format alongside transcripts
de: Wenn aktiviert, wird die rohe Audiodatei neben der Transkription gespeichert
es: Cuando está habilitado, guarda el archivo de audio sin procesar junto con la transcripción
fr: Lorsqu'il est activé, enregistre le fichier audio brut à côté de la transcription
ja: 有効にすると、トランスクリプトと一緒に生の音声ファイルが保存されます
zh_hans: 启用后，将原始音频文件与转录一起保存

# settings.output.saveOriginalAudio.accessibility.label
source: Save Original Audio File
de: Original-Audio speichern
es: Guardar audio original
fr: Enregistrer l'audio d'origine
ja: 元の音声を保存
zh_hans: 保存原始音频

# settings.output.saveOriginalAudio.label
source: Save Original Audio File
de: Original-Audio speichern
es: Guardar audio original
fr: Enregistrer l'audio d'origine
ja: 元の音声を保存
zh_hans: 保存原始音频

# settings.output.revealTranscriptInFinder.accessibility.hint
source: When enabled, opens Finder and selects the transcript file when recording stops
de: Wenn aktiviert, öffnet Finder und wählt die Transkriptdatei aus, wenn die Aufnahme stoppt
es: Cuando está habilitado, abre Finder y selecciona el archivo de transcripción cuando se detiene la grabación
fr: Lorsqu'il est activé, ouvre le Finder et sélectionne le fichier de transcription lorsque l'enregistrement s'arrête
ja: 有効にすると、録音が停止したときにFinderが開き、転写ファイルが選択されます
zh_hans: 启用后，录音停止时会打开访达并选择转录文件

# settings.output.revealTranscriptInFinder.accessibility.label
source: Reveal Transcript in Finder
de: Transkript im Finder anzeigen
es: Mostrar transcripción en Finder
fr: Afficher la transcription dans le Finder
ja: Finderで転写を表示
zh_hans: 在访达中显示转录

# settings.output.revealTranscriptInFinder.label
source: Reveal Transcript in Finder
de: Transkript im Finder anzeigen
es: Mostrar transcripción en Finder
fr: Afficher la transcription dans le Finder
ja: Finderで転写を表示
zh_hans: 在访达中显示转录

# settings.postRecording.action.doNothing
source: Do nothing
de: Nichts tun
es: No hacer nada
fr: Ne rien faire
ja: 何もしない
zh_hans: 不执行操作

# settings.postRecording.action.runScript
source: Run a script
de: Skript ausführen
es: Ejecutar script
fr: Exécuter un script
ja: スクリプトを実行
zh_hans: 运行脚本

# settings.postRecording.action.runShortcut
source: Run a shortcut
de: Shortcut ausführen
es: Ejecutar atajo
fr: Exécuter un raccourci
ja: ショートカットを実行
zh_hans: 运行快捷指令

# settings.postRecording.afterRecording.accessibility.hint
source: Choose what happens when recording stops: do nothing, run a script, or run a shortcut
de: Wählen Sie aus, was nach dem Stoppen einer Aufnahme passieren soll
es: Selecciona qué hacer después de detener una grabación
fr: Sélectionnez quoi faire après l'arrêt d'un enregistrement
ja: 録音を停止した後に実行する操作を選択します
zh_hans: 选择停止录音后要执行的操作

# settings.postRecording.afterRecording.accessibility.label
source: After recording
de: Aktion nach der Aufnahme
es: Acción después de grabar
fr: Action après l'enregistrement
ja: 録音後のアクション
zh_hans: 录音后操作

# settings.postRecording.afterRecording.label
source: After recording:
de: Nach dem Stoppen der Aufnahme
es: Después de detener la grabación
fr: Après l'arrêt de l'enregistrement
ja: 録音停止後
zh_hans: 停止录音后

# settings.postRecording.header
source: Post-Recording Action
de: Nach der Aufnahme
es: Después de grabar
fr: Après l'enregistrement
ja: 録音後
zh_hans: 录音后

# settings.postRecording.script.browse.accessibility.hint
source: Opens a dialog to select a shell script to run after recording
de: Öffnet einen Dialog zur Auswahl der Skriptdatei
es: Abre un diálogo para seleccionar el archivo de script
fr: Ouvre une boîte de dialogue pour sélectionner le fichier de script
ja: スクリプトファイルを選択するダイアログを開きます
zh_hans: 打开对话框以选择脚本文件

# settings.postRecording.script.browse.accessibility.label
source: Browse for Script
de: Skript durchsuchen
es: Examinar script
fr: Parcourir le script
ja: スクリプトを参照
zh_hans: 浏览脚本

# settings.postRecording.script.browseButton
source: Browse...
de: Durchsuchen…
es: Examinar…
fr: Parcourir…
ja: 参照…
zh_hans: 浏览…

# settings.postRecording.script.dialog.message
source: Choose a shell script to run after recording completes
de: Wählen Sie das Skript aus, das nach dem Stoppen der Aufnahme ausgeführt wird
es: Elige el script que se ejecutará después de detener la grabación
fr: Choisissez le script à exécuter après l'arrêt de l'enregistrement
ja: 録音停止後に実行するスクリプトを選択してください
zh_hans: 选择停止录音后要运行的脚本

# settings.postRecording.script.dialog.prompt
source: Select Script
de: Auswählen
es: Seleccionar
fr: Sélectionner
ja: 選択
zh_hans: 选择

# settings.postRecording.script.helpText
source: Script receives transcript path as $1
de: Das Skript erhält den Pfad der Transkriptionsdatei als erstes Argument. Stellen Sie sicher, dass das Skript ausführbar ist.
es: El script recibirá la ruta del archivo de transcripción como primer argumento. Asegúrate de que el script sea ejecutable.
fr: Le script recevra le chemin du fichier de transcription comme premier argument. Assurez-vous que le script est exécutable.
ja: スクリプトは最初の引数としてトランスクリプトファイルのパスを受け取ります。スクリプトが実行可能であることを確認してください。
zh_hans: 脚本将接收转录文件路径作为第一个参数。确保脚本是可执行的。

# settings.postRecording.script.path.accessibility.hint
source: Path to shell script that will receive the transcript file path as its first argument
de: Pfad zum Skript, das nach dem Stoppen der Aufnahme ausgeführt wird
es: Ruta al script que se ejecutará después de detener la grabación
fr: Chemin vers le script à exécuter après l'arrêt de l'enregistrement
ja: 録音停止後に実行するスクリプトへのパス
zh_hans: 停止录音后要执行的脚本路径

# settings.postRecording.script.path.accessibility.label
source: Shell Script Path
de: Skriptpfad
es: Ruta del script
fr: Chemin du script
ja: スクリプトパス
zh_hans: 脚本路径

# settings.postRecording.script.path.label
source: Shell Script Path
de: Skriptpfad
es: Ruta del script
fr: Chemin du script
ja: スクリプトパス
zh_hans: 脚本路径

# settings.postRecording.shortcut.helpText
source: The shortcut receives the transcript file path as input
de: Der Shortcut erhält den Pfad der Transkriptionsdatei als Eingabe.
es: El atajo recibirá la ruta del archivo de transcripción como entrada.
fr: Le raccourci recevra le chemin du fichier de transcription en entrée.
ja: ショートカットは入力としてトランスクリプトファイルのパスを受け取ります。
zh_hans: 快捷指令将接收转录文件路径作为输入。

# settings.postRecording.shortcut.loading
source: Loading shortcuts...
de: Shortcuts werden geladen…
es: Cargando atajos…
fr: Chargement des raccourcis…
ja: ショートカットを読み込んでいます…
zh_hans: 正在加载快捷指令…

# settings.postRecording.shortcut.loading.accessibility.label
source: Loading shortcuts
de: Shortcuts werden geladen
es: Cargando atajos
fr: Chargement des raccourcis
ja: ショートカットを読み込み中
zh_hans: 正在加载快捷指令

# settings.postRecording.shortcut.noShortcuts
source: No shortcuts found. Create shortcuts in the Shortcuts app first.
de: Keine Shortcuts gefunden. Erstellen Sie Shortcuts in der Shortcuts-App.
es: No se encontraron atajos. Crea atajos en la aplicación Atajos.
fr: Aucun raccourci trouvé. Créez des raccourcis dans l'application Raccourcis.
ja: ショートカットが見つかりません。ショートカットアプリでショートカットを作成してください。
zh_hans: 未找到快捷指令。在快捷指令应用中创建快捷指令。

# settings.postRecording.shortcut.picker.accessibility.hint
source: Choose a shortcut that will receive the transcript file path as input
de: Wählen Sie aus, welcher Shortcut nach dem Stoppen der Aufnahme ausgeführt wird
es: Selecciona qué atajo ejecutar después de detener la grabación
fr: Sélectionnez quel raccourci exécuter après l'arrêt de l'enregistrement
ja: 録音停止後に実行するショートカットを選択します
zh_hans: 选择停止录音后要运行的快捷指令

# settings.postRecording.shortcut.picker.accessibility.label
source: Shortcut
de: Shortcut auswählen
es: Seleccionar atajo
fr: Sélectionner un raccourci
ja: ショートカットを選択
zh_hans: 选择快捷指令

# settings.postRecording.shortcut.placeholder
source: Select a shortcut...
de: Shortcut auswählen…
es: Seleccionar atajo…
fr: Sélectionner un raccourci…
ja: ショートカットを選択…
zh_hans: 选择快捷指令…

# settings.silenceDetection.autoPause.accessibility.hint
source: Automatically pause recording after continuous silence. Recording will auto-resume when audio is detected
de: Wählen Sie aus, wie lange die Stille dauern soll, bevor automatisch pausiert wird, oder wählen Sie Nie zum Deaktivieren
es: Selecciona cuánto tiempo de silencio antes de pausar automáticamente, o elige Nunca para deshabilitar
fr: Sélectionnez la durée du silence avant la pause automatique, ou choisissez Jamais pour désactiver
ja: 自動的に一時停止するまでの無音時間を選択するか、無効にするには「しない」を選択します
zh_hans: 选择自动暂停前的静音时长，或选择"从不"以禁用

# settings.silenceDetection.autoPause.accessibility.label
source: Auto-pause after silence
de: Automatische Pause nach Stille
es: Pausa automática después del silencio
fr: Pause automatique après silence
ja: 無音後に自動一時停止
zh_hans: 静音后自动暂停

# settings.silenceDetection.autoPause.label
source: Auto-pause after silence:
de: Automatische Pause nach Stille
es: Pausa automática después del silencio
fr: Pause automatique après silence
ja: 無音後に自動一時停止
zh_hans: 静音后自动暂停

# settings.silenceDetection.header
source: Silence Detection
de: Stille-Erkennung
es: Detección de silencio
fr: Détection du silence
ja: 無音検出
zh_hans: 静音检测

# settings.silenceDetection.helpText
source: Automatically pause recording after continuous silence. Recording will auto-resume when audio is detected.
de: Pausiert die Aufnahme automatisch nach dem angegebenen Stillezeitraum. Nützlich zum Pausieren während langer Pausen in Gesprächen.
es: Pausa automáticamente la grabación después del período de silencio especificado. Útil para pausar durante largas pausas en las conversaciones.
fr: Met automatiquement en pause l'enregistrement après la période de silence spécifiée. Utile pour faire une pause pendant de longues pauses dans les conversations.
ja: 指定された無音期間の後、録音を自動的に一時停止します。会話の長い休止中に一時停止するのに便利です。
zh_hans: 在指定的静音期后自动暂停录音。适用于在对话中的长时间停顿期间暂停。

# silenceThreshold.fiveMinutes
source: 5 minutes
de: 5 Minuten
es: 5 minutos
ja: 5分
zh_hans: 5分钟

# silenceThreshold.never
source: Never
de: Nie
es: Nunca
fr: Jamais
ja: なし
zh_hans: 从不

# silenceThreshold.tenMinutes
source: 10 minutes
de: 10 Minuten
es: 10 minutos
ja: 10分
zh_hans: 10分钟

# silenceThreshold.twoMinutes
source: 2 minutes
de: 2 Minuten
es: 2 minutos
ja: 2分
zh_hans: 2分钟

# transcript.header.dateLabel
source: Date:
de: Datum:
es: Fecha:
ja: 日付：
zh_hans: 日期：

# transcript.header.title
source: Olive - Call Transcription Transcript
de: Olive - Anruftranskription
es: Olive - Transcripción de llamadas
fr: Olive - Transcription d'appels
ja: Olive - 通話文字起こし
zh_hans: Olive - 通话转录

# transcript.header.titleLabel
source: Title:
de: Titel:
es: Título:
fr: Titre :
ja: タイトル：
zh_hans: 标题：

# menubar.alert.button.ok
source: OK
es: Aceptar
zh_hans: 好

# settings.postRecording.shortcut.picker.label
source: Shortcut:
es: Atajo
fr: Raccourci
ja: ショートカット
zh_hans: 快捷指令
